Revit 2027 API
ParameterTypeId.RebarBarDeformationType Property
 "Deformation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarDeformationType { get; }
Public Shared ReadOnly Property RebarBarDeformationType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarDeformationType {
	ForgeTypeId^ get ();
}
static member RebarBarDeformationType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace